testing/stress-tests/GET-stress-test.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 60
      arrivalRate: 10
      name: 10 RPS
    - duration: 60
      arrivalRate: 100
      name: 100 RPS
    - duration: 60
      arrivalRate: 1000
      name: 1000 RPS
scenarios:
  - name: "GET restaurant info"
    flow:
      - get:
          url: "/{{$randomNumber(8000000, 10000000)}}"